var deptNames = {
"54100":"医学部",
"54101":"医务处",
"54104":"医学部",
"97000":"产业集团",
"10000":"岭南学院",
"12000":"法学院",
"13000":"政务院",
"14000":"管理学院",
"16000":"教育学院",
"17000":"传设院",
"18000":"汉语学院",
"30000":"理工学院",
"31000":"化学院",
"32000":"地环学院",
"33000":"生科院",
"35000":"信科院",
"38000":"环境学院",
"39000":"工学院",
"50000":"中山医",
"52000":"光华口腔",
"53000":"护理学院",
"55000":"基础医学院",
"60000":"网络教育学院",
"61000":"高教院",
"62000":"软件学院",
"09000":"研究基地",
"95000":"后勤集团",
"96000":"企业单位",
"99010":"高等学术研究中心",
"99020":"广东发展研究院",
"99030":"创新科技研究院",
"99040":"规划设计研究院",
"99050":"马克思主义理论研究中心",
"99060":"中华传统文化研究中心",
"99070":"人防办",
"01010":"党宣办",
"01020":"党办",
"01030":"宣传部",
"01040":"纪检",
"01070":"审计处",
"01080":"组织部、统战部联合办公室",
"01090":"组织部",
"01100":"统战部",
"01110":"学生处",
"01120":"离退休处",
"01130":"校工会",
"01140":"校团委",
"02010":"校办",
"02015":"规划办",
"02020":"人事处",
"02030":"教务处",
"02036":"教育教学评估中心",
"02070":"社科处",
"02080":"设备",
"02086":"招标",
"02100":"财务",
"02110":"保卫处",
"02120":"保卫处",
"02130":"武装部",
"02300":"研究生院",
"02320":"211办",
"02400":"珠海校区",
"02420":"后勤",
"02500":"总务",
"02510":"基建",
"02520":"医管处",
"02610":"成教处",
"04010":"岭南学院",
"04020":"人文学院",
"04030":"法学院",
"04040":"政务学院",
"04050":"管院",
"04060":"外院",
"04070":"教育学院",
"04200":"理工学院",
"04210":"化学院",
"04220":"地环学院",
"04230":"生科院",
"04240":"数计院",
"04250":"信科院",
"04260":"环境学院",
"04270":"地科院",
"04280":"地球科学系",
"04290":"工学院",
"04310":"附一院",
"04320":"附二院",
"04330":"附三院",
"04340":"眼科中心",
"04350":"肿瘤医院",
"04370":"护理学院",
"04380":"光华口腔",
"04390":"黄埔医院",
"04410":"基础医学院",
"04500":"珠海校区",
"04510":"机关党委",
"04520":"后勤党委",
"04530":"离退休处",
"04550":"附属学校",
"04560":"产业集团",
"04570":"高教院",
"05010":"网络中心",
"05020":"图书馆",
"05040":"测试中心",
"05060":"学报",
"05070":"动物中心",
"05090":"校医院",
"05100":"保健室",
"05110":"附属学校",
"05120":"规划办",
"05140":"驻京办",
"05150":"招生办",
"05160":"校友与基金",
"40000":"旅游学院",
"16110":"心理学系",
"16230":"心理咨询",
"100001":"地环学院",
"100002":"地学院",
"100003":"附二院",
"100004":"附三院",
"100006":"附一院",
"100009":"管院",
"100010":"化工学院",
"100012":"理工学院",
"100013":"历史系",
"100014":"岭院",
"100015":"生科院",
"100016":"数计学院",
"100017":"孙逸仙纪念医院",
"100018":"网络学院法学",
"100020":"信科学院",
"100021":"学校",
"100022":"政务学院",
"54200":"党委",
"54201":"团委",
"54202":"分工会",
"54300":"基础医学院",
"61010":"颐园学院",
"80000":"附一院",
"82000":"附三院",
"83000":"眼科中心",
"85000":"肿瘤医院",
"86000":"肿瘤研究所",
"87000":"附属口腔医院",
"32110":"地科系",
"50310":"第二临床医学部",
"50320":"第三临床医学部",
"09430":"国家药品监督局药品临床研究基地",
"11000":"人文学院",
"19000":"外教中心",
"20000":"资讯学院",
"02711":"东校区管委会",
"02700":"东校区",
"02710":"东校区管委会",
"04580":"传设院",
"99100":"中山大学能源工程研究所",
"02050":"科技处",
"02060":"医科处",
"02090":"外事处",
"02600":"房产",
"04300":"医学部",
"04360":"卫生学院",
"04400":"药学院",
"04540":"离退休处",
"05030":"档案馆",
"05080":"期刊中心",
"05130":"80周年校庆办",
"100005":"附五院",
"100011":"环境学院",
"100019":"网络学院数计",
"54105":"医学教育研究中心（国家医学教育发展中心）",
"81000":"附二院",
"84000":"肿瘤医院",
"88000":"附六院",
"50300":"第一临床医学部",
"99090":"心理咨询",
"02040":"就业指导",
"100008":"高教院",
"21000":"翻译学院",
"69000":"其他学院",
"34000":"数计学院",
"15000":"外院",
"36000":"药学院",
"54000":"医学部",
"99080":"中山大学编辑学与出版研究中心",
"100007":"港澳珠江三角洲研究中心",
"100023":"中文系",
"8a7f809008ac97ae0108ff63e0c900f2":"科技创新平台和哲学社会科学创新基地",
"8a7f8090093ecccc01096b71f6a10024":"中山大学BP-LNG教育培训研究中心",
"8a7f809009962aa00109b3ed38330187":"“985”办",
"8a7f809009962aa00109b3ed92650188":"“211”办",
"8a7f809009962aa00109b3ee387c0189":"高教所",
"8a7f809009c7fba80109d929c0060160":"资讯学院",
"8a7f80900adf7f99010adf9d56f40008":"国际商学院",
"8a7f80900b844fe7010b94273ec60039":"艺术教育中心",
"8a7f809012739cea011278e8258f00fc":"校友与基金",
"8a7f809012739cea011279040dfe0100":"北校区",
"8a7f80901324722c0113b92395420349":"新华学院",
"8a7f80901324722c0113b924268d034a":"南方学院",
"8a7f809019b191340119b3146c400039":"亚太研究院",
"8a7f80901b1125d7011b2ee900d60028":"海洋学院",
"8a7f80901e24e8c1011e38019cbb00b4":"生物安全三级实验室",
"8a7f80901f442fde011f44329eab0001":"社人院",
"8a7f80901f442fde011f4444884c0002":"先进技术研究院",
"37000":"地规院",
"51000":"卫生学院",
"89000":"附五院",
"8a7f80900a16ab5f010a2af7edb3030f":"知识产权",
"8a7f8090227c533f0122a4fbc442007f":"人文高等研究院",
"8a7f8090227c533f0122a4fc4fb70081":"博雅学院",
"8a7f8090227c533f0122de2135ea00db":"软件人才培训中心",
"8a7f8090245b3be301257bae31120524":"社会学与人类学学院党委",
"8a7f8090245b3be301257bb26fc90525":"广东决策科学研究院",
"8a7f8090245b3be301257bb35e4d0526":"中山大学社会科学高等研究院",
"8a7f8090245b3be301257bc8c197052a":"中山大学海外项目拓展与管理中心（珠海校区）",
"8a7f809026b5976c0127270c1e2000fb":"国际汉语教材研发与培训基地",
"8a7f809027e06e690127f4a193280022":"核工程学院",
"8a7f809029248af201292f37542600a9":"院办",
"4028801c260136cb012602df45b4000b":"人事",
"4028808d2552040201255232235d002b":"人事",
"ff8080812c755e26012c75db9cd6001b":"人事",
"ff8080812c7bc519012c833b8373004a":"人事",
"ff8080812c7bc519012c838c0c7e00a2":"人事",
"4028808d244d47e601244d57c42f0003":"人事",
"ff8080812c7bc519012c838449d60098":"人事",
"ff8080812c7bc519012c82f1500b0006":"人事",
"ff8080812c755e26012c757d25a9000d":"人事",
"40280a082ea2f33c012ea3327af3002e":"人事",
"A2E40DD9AEF14016E0430A1000204016":"环南中国海研究院",
"A2E40DD9AEF24016E0430A1000204016":"金融工程与风险管理研究中心",
"AD5D4115417390A4E0430A10002090A4":"社会科学教育学院",
"AD99239EF6F760FCE0430A10002060FC":"中山大学岭南文化研究院",
"ADD3EA12C590B072E0430A100020B072":"珠三角改革发展研究院",
"B1C28B213B5620E0E0430A10002020E0":"保密学院"
};

function showColumn(el, columnId, rows, cols){
	if(!rows)
		rows = 5;
	
	if(!cols)
		cols = 20;
	
	var html = '';
	var column = colsDefault[columnId];
	for(var i=0; i<column.informations.length && i < rows; i++){
		var inf = column.informations[i];
		var title = inf.bt;
                var title1;
		if(title.length > cols)
			title1 = title.substring(0, cols) + '...';
				else
                 title1 = title;
		var dept = deptNames[inf.dept];
		if(!dept)
			dept = '中大';
		
		html += '<li><span class="newstime">'+inf.time.substring(5)+'</span><a href="' + inf.link + '" target="_blank" title="'+ title +'">['+dept+']'+title1+'</a></li>';

	}
	
	document.getElementById(el).innerHTML = html;
}
function showColumn2(el, columnId, rows, cols){
	if(!rows)
		rows = 5;
	
	if(!cols)
		cols = 20;
	
	var html = '';
	var column = colsDefault[columnId];
	for(var i=0; i<column.informations.length && i < rows; i++){
		var inf = column.informations[i];
		var title = inf.bt;
                var title1;
		if(title.length > cols)
			title1 = title.substring(0, cols) + '...';
		else
                 title1 = title;
		var dept = deptNames[inf.dept];
		if(!dept)
			dept = '中大';
		
		html += '<li><span class="newstime">'+inf.time.substring(5)+'</span><a href="' + inf.link + '" target="_blank" title="'+ title +'">'+title1+'</a></li>';

	}
	
	document.getElementById(el).innerHTML = html;
}
function showColumn3(el, columnId, rows, cols){
	if(!rows)
		rows = 5;
	
	if(!cols)
		cols = 20;
	
	var html = '';
	var column = colsDefault[columnId];
	for(var i=0; i<column.informations.length && i < rows; i++){
		var inf = column.informations[i];
		var title = inf.bt;
                var title1;
		if(title.length > cols)
			title1 = title.substring(0, cols) + '...';
				else
                 title1 = title;
		var dept = deptNames[inf.dept];
		if(!dept)
			dept = '中大';
		
		html += '<li><span class="newstime">'+inf.time.substring(5)+'</span><a href="' + inf.link + '" target="_blank" title="'+ title +'">'+title1+'</a></li>';

	}
	
	document.getElementById(el).innerHTML = html;
}